<template>
  <div class="modal_window">
    <div class="modal_window_i">
      <div class="mw_up">
        <span>Политика конфиденциальности</span>
        <img class="close_btn" src="../../static/svg/close.svg" alt="Nope" @click="close">
      </div>
      <div class="privacy">
        <p>Настоящая Политика конфиденциальности персональной
          информации (далее — Политика) действует в отношении всей
          информации, которую Сайт ( могут получить о пользователе во
          время использования им сайта. Согласие пользователя на
          предоставление персональной информации, данное им в
          соответствии с настоящей Политикой в рамках отношений с одним
          из лиц, входящих, распространяется на все лица.
        </p>
        <p class="privacy__text2">
          Использование Сайта означает безоговорочное согласие
          пользователя с настоящей Политикой и указанными в ней
          условиями обработки его персональной информации; в случае
          несогласия с этими условиями пользователь должен воздержаться
          от использования Сервисов.
        </p>
        <div>
          <p class="privacy__text2">
            1. Персональная информация пользователей, которую получает и обрабатывает Сайт
          </p>
          <p class="privacy__text2">
            1.1. В рамках настоящей Политики под «персональной информацией пользователя» понимаются:
          </p>
          <p class="privacy__text2">
            1.1.1. Персональная информация, которую пользователь предоставляет о себе самостоятельно заполнении форм обратной связи, включая персональные данные пользователя. Обязательная для предоставления Сервисов (оказания услуг) информация помечена специальным образом. Иная информация предоставляется пользователем на его усмотрение.
          </p>
          <p class="privacy__text2">
            1.1.2 Данные, которые автоматически передаются в процессе их использования с помощью установленного на устройстве пользователя программного обеспечения, в том числе IP-адрес, информация из cookie, информация о браузере пользователя (или иной программе, с помощью которой осуществляется доступ к Сервисам), время доступа, адрес запрашиваемой страницы.
          </p>
          <p class="privacy__text2">
            1.2. Настоящая Политика применима только к Сайт. Сайт не контролирует и не несет ответственность за сайты третьих лиц, на которые пользователь может перейти по ссылкам, доступным на сайтах Сайт , в том числе в результатах поиска. На таких сайтах у пользователя может собираться или запрашиваться иная персональная информация, а также могут совершаться иные действия.
          </p>
          <p class="privacy__text2">
            1.3. Сайт в общем случае не проверяет достоверность персональной информации, предоставляемой пользователями, и не осуществляет контроль за их дееспособностью. Однако Сайт исходит из того, что пользователь предоставляет достоверную и достаточную персональную информацию по вопросам, предлагаемым в форме регистрации, и поддерживает эту информацию в актуальном состоянии.
          </p>
        </div>
        <div>
          <p class="privacy__text2">
            2. Цели сбора и обработки персональной информации пользователей
          </p>
          <p class="privacy__text2">
            2.1. Сайт собирает и хранит только те персональные данные, которые необходимы для предоставления и оказания услуг (исполнения соглашений и договоров с пользователем).
          </p>
          <p class="privacy__text2">
            2.2. Персональную информацию пользователя Сайт может использовать в следующих целях:
          </p>
          <p class="privacy__text2">
            2.2.1. Идентификация стороны в рамках соглашений и договоров с Сайт
          </p>
          <p class="privacy__text2">
            2.2.2. Предоставление пользователю персонализированных услуг;
          </p>
          <p class="privacy__text2">
            2.2.3. Связь с пользователем, в том числе направление уведомлений, запросов и информации, касающихся использования Сервисов, оказания услуг, а также обработка запросов и заявок от пользователя;
          </p>
          <p class="privacy__text2">
            2.2.4. Улучшение качества, удобства их использования, разработка услуг;
          </p>
          <p class="privacy__text2">
            2.2.5. Таргетирование рекламных материалов;
          </p>
          <p class="privacy__text2">
            2.2.6. Проведение статистических и иных исследований на основе обезличенных данных.
          </p>
        </div>
        <div>
          <p class="privacy__text2">
            3. Условия обработки персональной информации пользователя и её передачи третьим лицам
          </p>
          <p class="privacy__text2">
            3.1. Сайт хранит персональную информацию пользователей в соответствии с внутренними регламентами конкретных сервисов.
          </p>
          <p class="privacy__text2">
            3.2. В отношении персональной информации пользователя сохраняется ее конфиденциальность, кроме случаев добровольного предоставления пользователем информации о себе для общего доступа неограниченному кругу лиц. При использовании отдельных Сервисов пользователь соглашается с тем, что определённая часть его персональной информации становится общедоступной.
          </p>
          <p class="privacy__text2">
            3.3. Сайт вправе передать персональную информацию пользователя третьим лицам в следующих случаях:
          </p>
          <p class="privacy__text2">
            3.3.1. Пользователь выразил свое согласие на такие действия;
          </p>
          <p class="privacy__text2">
            3.3.2. Передача необходима в рамках использования пользователем определенного Сервиса либо для оказания услуги пользователю;
          </p>
          <p class="privacy__text2">
            3.3.3. Передача предусмотрена российским или иным применимым законодательством в рамках установленной законодательством процедуры;
          </p>
          <p class="privacy__text2">
            3.3.4. Такая передача происходит в рамках продажи или иной передачи бизнеса (полностью или в части), при этом к приобретателю переходят все обязательства по соблюдению условий настоящей Политики применительно к полученной им персональной информации;
          </p>
          <p class="privacy__text2">
            3.3.5. В целях обеспечения возможности защиты прав и законных интересов Сайт или третьих лиц в случаях, когда пользователь нарушает Пользовательское соглашение сервисов Сайт.
          </p>
          <p class="privacy__text2">
            3.4. При обработке персональных данных пользователей Сайт руководствуется Федеральным законом РФ «О персональных данных».
          </p>
        </div>
        <div>
          <p class="privacy__text2">
            4. Изменение пользователем персональной информации
          </p>
          <p class="privacy__text2">
            4.1. Пользователь может в любой момент изменить (обновить, дополнить) предоставленную им персональную информацию или её часть, а также параметры её конфиденциальности.
          </p>
        </div>
        <div>
          <p class="privacy__text2">
            5. Меры, применяемые для защиты персональной информации пользователей Сайт принимает необходимые и достаточные организационные и технические меры для защиты персональной информации пользователя от неправомерного или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения, а также от иных неправомерных действий с ней третьих лиц.
          </p>
        </div>
        <div>
          <p class="privacy__text2">
            6. Изменение Политики конфиденциальности. Применимое законодательство
          </p>
          <p class="privacy__text2">
            6.1. Сайт имеет право вносить изменения в настоящую Политику конфиденциальности. При внесении изменений в актуальной редакции указывается дата последнего обновления. Новая редакция Политики вступает в силу с момента ее размещения, если иное не предусмотрено новой редакцией Политики.
          </p>
          <p class="privacy__text2">
            6.2. К настоящей Политике и отношениям между пользователем и Сайт , возникающим в связи с применением Политики конфиденциальности, подлежит применению право Российской Федерации.
          </p>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  name: "privacyPolicy",
  props: {
    closeModal: Function
  },
  methods: {
    close() {
      this.closeModal()
    }
  }
}

</script>

<style lang="scss" scoped>
/* Style the scrollbar track (background) */
::-webkit-scrollbar {
  width: 5px;
  background: #000;
}

/* Style the scrollbar handle */
::-webkit-scrollbar-thumb {
  background: #fff;
  border-radius: 3px;
}

/* Handle on hover */
::-webkit-scrollbar-thumb:hover {
  background: #fff;
}

p {
  font-family: 'Roboto';
}

.privacy {
  padding: 25px;
  color: #000;
  font-size: 16px;
  font-weight: 400;
  display: flex;
  gap: 40px;
  flex-direction: column;
  max-height: 500px;
  overflow-y: scroll;
}
.modal_window {
  position: fixed;
  top: 0;
  left: 0;
  width: 100%;
  height: 100%;
  background-color: rgba(0, 0, 0, .5);
  z-index: 1120;
  transition: .3s all;
  display: flex;
  justify-content: center;
  align-items: center;
  color: black;

  .modal_window_i {
    align-items: center;
    width: 565px;
    height: auto;
    background-color: white;
    border-radius: 15px;
    overflow: hidden;
    display: flex;
    flex-direction: column;
    justify-content: space-between;

    span {
      font-size: 16px;
      text-align: center;
    }
  }
}

.mw_up {
  background-color: #FFDBBA;
  width: 100%;
  height: 60px;
  display: flex;
  justify-content: space-between;
  align-items: center;
  padding: 0 1.5rem;

  span {
    font-weight: 500 !important;
    font-size: 16px;
    color: rgba(0, 0, 0, 0.6);
  }
}
.close_btn {
  cursor: pointer;
}
@media screen and (max-width: 470px) {
  .modal_window .modal_window_i {
    width: 90%;
  }
  .privacy {
    font-size: 13px;
    gap: 10px;
    margin: 20px;
  }
  p {
    margin-bottom: 0;
  }
}
</style>
